"""
Пользователь вводит строку из нескольких слов, разделённых пробелами.
Вывести каждое слово с новой строки.
Строки необходимо пронумеровать.
Если в слово длинное, выводить только первые 10 букв в слове.
"""

user_str = input('\nВведите строку из нескольких слов, разделённых пробелами \n')
user_list = user_str.split(' ')

str_number = 1
for item in user_list:
    print(f'{str_number}---{item[:10]}')
    str_number += 1
