"""
Для списка реализовать обмен значений соседних элементов, т.е.
значениями обмениваются элементы с индексами 0 и 1, 2 и 3 и т.д.
При нечетном количестве элементов последний сохранить на своем месте.
Для заполнения списка элементов необходимо использовать функцию input()
"""


my_str = input('Укажите список элементов через запятую \n')
my_list = my_str.split(',')

index = 0

while index < (len(my_list) - 1):
    my_list[index], my_list[index + 1] = my_list[index + 1], my_list[index]
    index += 2
print(my_list)




