"""
Реализовать два небольших скрипта:
а) итератор, генерирующий целые числа, начиная с указанного,
б) итератор, повторяющий элементы некоторого списка, определенного заранее.
Подсказка: использовать функцию count() и cycle() модуля itertools.
Обратите внимание, что создаваемый цикл не должен быть бесконечным. Необходимо предусмотреть условие его завершения.
Например, в первом задании выводим целые числа, начиная с 3, а при достижении числа 10 завершаем цикл.
Во втором также необходимо предусмотреть условие, при котором повторение элементов списка будет прекращено.
"""

from itertools import count, cycle

number_list = [1, 34, 46534, 345, 65, 345, 347, 7]


for el in count(3):
    if el > 10:
        break
    print(el)


print('#' * 30)


stop_cycle = 0

for el in cycle(number_list):
    if stop_cycle == len(number_list):
        break
    print(el)
    stop_cycle += 1




