"""
Программа принимает действительное положительное число x и целое отрицательное число y.
Необходимо выполнить возведение числа x в степень y. Задание необходимо реализовать в виде функции my_func(x, y).
При решении задания необходимо обойтись без встроенной функции возведения числа в степень.
Подсказка: попробуйте решить задачу двумя способами. Первый — возведение в степень с помощью оператора **.
Второй — более сложная реализация без оператора **, предусматривающая использование цикла.
"""

x = 3
y = -3


def my_func(x, y):
    result = x ** y
    return result


def my_func_2(x, y):
    result = 1
    for item in range(abs(y)):
        result *= x
    if y > 0:
        return result
    else:
        return 1 / result


print(my_func(x, y))
print(my_func_2(x, y))
