"""
Реализовать функцию my_func(), которая принимает три позиционных аргумента
и возвращает сумму наибольших двух аргументов
"""


a = 5
b = 10
c = 123

def my_func(a: float, b: float, c: float) -> float:
    """
    функция принимает три позиционных аргумента и возвращает сумму наибольших двух аргументов
    :param a: первый аргумент
    :param b: второй аргумент
    :param c: третий аргумент
    :return: возврат суммы наибольших двух аргументов
    """
    my_list = [a, b, c]
    my_list.sort(reverse=True)
    result = my_list[0] + my_list[1]
    return result

print(my_func (a, b, c))