"""
Создать текстовый файл (не программно), построчно записать фамилии сотрудников и величину их окладов.
Определить, кто из сотрудников имеет оклад менее 20 тыс., вывести фамилии этих сотрудников.
Выполнить подсчет средней величины дохода сотрудников.
"""

with open('task3.txt', 'r') as file:
    content = file.readlines()
    sum_salary = 0
    print(f'Список сотрудников с доходом менее 20000 руб:')
    for line in content:
        if float(line.split()[-1]) < 20000:
            print(line.split()[0])
        sum_salary += float(line.split()[-1])
    print(f'\nСредняя величина дохода сотрудников равна {round(sum_salary / len(content), 2)}')

